import math


def area(r):
    '''
    Возвращает площадь круга по его радиусу.

        Параметры:
            r (int | float): радиус круга

        Возвращаемое значение:
            (float): площадь круга, вычисленная по формуле S = π*R^2

        Пример вызова:
            >>> area(1)
            3.141592653589793
    '''
    return math.pi * r * r


def perimeter(r):
    '''
    Возвращает длину окружности (периметр круга) по его радиусу.

        Параметры:
            r (int | float): радиус круга

        Возвращаемое значение:
            (float): длина окружности, вычисленная по формуле P = 2*π*R

        Пример вызова:
            >>> perimeter(1)
            6.283185307179586
    '''
    return 2 * math.pi * r
