def area(a, b):
    '''
    Возвращает площадь прямоугольника по длинам двух его сторон.

        Параметры:
            a (int | float): длина первой стороны прямоугольника
            b (int | float): длина второй стороны прямоугольника

        Возвращаемое значение:
            (int | float): площадь прямоугольника, вычисленная по формуле S = a*b

        Пример вызова:
            >>> area(3, 4)
            12
    '''
    return a * b


def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника по длинам двух его сторон.

        Параметры:
            a (int | float): длина первой стороны прямоугольника
            b (int | float): длина второй стороны прямоугольника

        Возвращаемое значение:
            (int | float): периметр прямоугольника, вычисленный по формуле P = 2*(a + b)

        Пример вызова:
            >>> perimeter(3, 4)
            14
    '''
    return 2 * (a + b)
