
def area(a):
    '''
    Возвращает площадь квадрата по длине его стороны.

        Параметры:
            a (int | float): длина стороны квадрата

        Возвращаемое значение:
            (int | float): площадь квадрата, вычисленная по формуле S = a^2

        Пример вызова:
            >>> area(5)
            25
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата по длине его стороны.

        Параметры:
            a (int | float): длина стороны квадрата

        Возвращаемое значение:
            (int | float): периметр квадрата, вычисленный по формуле P = 4*a

        Пример вызова:
            >>> perimeter(5)
            20
    '''
    return 4 * a
