def area(a, h):
    '''
    Возвращает площадь треугольника по основанию и высоте.

        Параметры:
            a (int | float): длина основания треугольника
            h (int | float): высота, опущенная на основание

        Возвращаемое значение:
            (float): площадь треугольника, вычисленная по формуле S = a*h/2

        Пример вызова:
            >>> area(3, 4)
            6.0
    '''
    return a * h / 2


def perimeter(a, b, c):
    '''
    Возвращает периметр треугольника по длинам трёх его сторон.

        Параметры:
            a (int | float): длина первой стороны
            b (int | float): длина второй стороны
            c (int | float): длина третьей стороны

        Возвращаемое значение:
            (int | float): периметр треугольника, вычисленный по формуле P = a + b + c

        Пример вызова:
            >>> perimeter(3, 4, 5)
            12
    '''
    return a + b + c